<a href="https://colab.research.google.com/github/Thanushkabairy/Thanushkabairy/blob/main/Untitled3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Data Wrongling steps

In [12]:
import pandas as pd
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve","Alice","Charlie"],
    "Age": [25, None, 30, 40, None,25,30],
    "City": ["New York", "London", None, "Paris", "Berlin","New York",None],
    "Salary": [50000, 60000, None, 80000, 90000,50000,None]
}

df = pd.DataFrame(data)
print("Original Data:\n", df, "\n")
df = df.dropna(subset=['Salary'])
print(df)
df['Age'] = df['Age'].fillna(df['Age'].mean())
df['City'] = df['City'].fillna("Unknown")
df = df.drop_duplicates()
print(df)
df = df.rename(columns={"Name": "Employee_Name", "Age": "Employee_Age"})
df['Employee_Age'] = df['Employee_Age'].astype(int)
print(df)
df_filtered = df[df['Salary'] > 60000]   # employees with salary > 60000
print(df)
df['Bonus'] = df['Salary'] * 0.10   # 10% bonus
print(df)
df = df.sort_values(by='Salary', ascending=False)
print(df)
df_group = df.groupby('City')['Salary'].mean()
print(df_group)

Original Data:
       Name   Age      City   Salary
0    Alice  25.0  New York  50000.0
1      Bob   NaN    London  60000.0
2  Charlie  30.0      None      NaN
3    David  40.0     Paris  80000.0
4      Eve   NaN    Berlin  90000.0
5    Alice  25.0  New York  50000.0
6  Charlie  30.0      None      NaN

    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0
1    Bob   NaN    London  60000.0
3  David  40.0     Paris  80000.0
4    Eve   NaN    Berlin  90000.0
5  Alice  25.0  New York  50000.0
    Name   Age      City   Salary
0  Alice  25.0  New York  50000.0
1    Bob  30.0    London  60000.0
3  David  40.0     Paris  80000.0
4    Eve  30.0    Berlin  90000.0
  Employee_Name  Employee_Age      City   Salary
0         Alice            25  New York  50000.0
1           Bob            30    London  60000.0
3         David            40     Paris  80000.0
4           Eve            30    Berlin  90000.0
  Employee_Name  Employee_Age      City   Salary
0         Alice            25  New York  50000.0
1           Bob            30    London  60000.0
3         David            40     Paris  80000.0
4           Eve            30    Berlin  90000.0
  Employee_Name  Employee_Age      City   Salary   Bonus
0         Alice            25  New York  50000.0  5000.0
1           Bob            30    London  60000.0  6000.0
3         David            40     Paris  80000.0  8000.0
4           Eve            30    Berlin  90000.0  9000.0
  Employee_Name  Employee_Age      City   Salary   Bonus
4           Eve            30    Berlin  90000.0  9000.0
3         David            40     Paris  80000.0  8000.0
1           Bob            30    London  60000.0  6000.0
0         Alice            25  New York  50000.0  5000.0
City
Berlin      90000.0
London      60000.0
New York    50000.0
Paris       80000.0
Name: Salary, dtype: float64

product

In [17]:
import pandas as pd

# Sample dataset of products
data = {
    "Product": ["Laptop", "Phone", "Tablet", "Monitor", "Keyboard", "Laptop", "Tablet"],
    "Price": [800, 500, None, 300, None, 800, None],
    "Category": ["Electronics", "Electronics", None, "Electronics", "Accessories", "Electronics", None],
    "Stock": [50, 100, None, 30, 200, 50, None]
}

df = pd.DataFrame(data)
print("Original Data:\n", df, "\n")

# Drop rows with missing Stock values
df = df.dropna(subset=['Stock'])
print("After dropping missing Stock:\n", df, "\n")

# Fill missing Price with mean, Category with "Misc"
df['Price'] = df['Price'].fillna(df['Price'].mean())
print(df)
df['Category'] = df['Category'].fillna("Misc")
print(df)
df['Price'] = df['Price'].astype(int)
print(df)
df = df.sort_values(by='Product', ascending=False)
print(df)
df = df.drop_duplicates()
print(df)

Original Data:
     Product  Price     Category  Stock
0    Laptop  800.0  Electronics   50.0
1     Phone  500.0  Electronics  100.0
2    Tablet    NaN         None    NaN
3   Monitor  300.0  Electronics   30.0
4  Keyboard    NaN  Accessories  200.0
5    Laptop  800.0  Electronics   50.0
6    Tablet    NaN         None    NaN

After dropping missing Stock:
     Product  Price     Category  Stock
0    Laptop  800.0  Electronics   50.0
1     Phone  500.0  Electronics  100.0
3   Monitor  300.0  Electronics   30.0
4  Keyboard    NaN  Accessories  200.0
5    Laptop  800.0  Electronics   50.0

    Product  Price     Category  Stock
0    Laptop  800.0  Electronics   50.0
1     Phone  500.0  Electronics  100.0
3   Monitor  300.0  Electronics   30.0
4  Keyboard  600.0  Accessories  200.0
5    Laptop  800.0  Electronics   50.0
    Product  Price     Category  Stock
0    Laptop  800.0  Electronics   50.0
1     Phone  500.0  Electronics  100.0
3   Monitor  300.0  Electronics   30.0
4  Keyboard  600.0  Accessories  200.0
5    Laptop  800.0  Electronics   50.0
    Product  Price     Category  Stock
0    Laptop    800  Electronics   50.0
1     Phone    500  Electronics  100.0
3   Monitor    300  Electronics   30.0
4  Keyboard    600  Accessories  200.0
5    Laptop    800  Electronics   50.0
    Product  Price     Category  Stock
1     Phone    500  Electronics  100.0
3   Monitor    300  Electronics   30.0
0    Laptop    800  Electronics   50.0
5    Laptop    800  Electronics   50.0
4  Keyboard    600  Accessories  200.0
    Product  Price     Category  Stock
1     Phone    500  Electronics  100.0
3   Monitor    300  Electronics   30.0
0    Laptop    800  Electronics   50.0
4  Keyboard    600  Accessories  200.0